package com.laola.apa.costant;

import java.util.HashMap;
import java.util.Map;

public class AdjustedCostant {
    public static final Map<String, String> adjustedMap = new HashMap<String, String>() {
        {
            /**
             * 试剂臂
             */
            //3.1.1	试剂臂在清洗口位置升降
            put("REAGENT_CLEAN_VERTICAL", "E5 90 8C 01 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 01 00 00

            //3.1.2	试剂臂在试剂盘一位置升降
            put("REAGENT_REAGENT_FIRST_VERTICAL", "E5 90 8C 01 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 01 01 00

            //3.1.3	试剂臂在反应盘位置升降
            put("REAGENT_REACT_VERTICAL", "E5 90 8C 01 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 01 02 00

            //3.1.4	试剂臂在试剂盘二位置升降
            //2）动作完成返回：EB  91  8C 01 03 00
            put("REAGENT_REAGENT_SECOND_VERTICAL", "E5 90 8C 01 03 00 00 00 00 00 00 00 00 00 00 00");
            //注：此命令用于200型号的加样臂的样品位垂直调校

            //3.1.5	试剂臂在试剂盘三位置升降
            put("REAGENT_REAGENT_THIRD_VERTICAL", "E5 90 8C 01 04 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 01 04 00


            /**
             * 试剂臂水平调校（8C 02）
             */
            //3.2.1	试剂臂在清洗口位置转头
            put("REAGENT_CLEAN_HORIZONTAL", "E5 90 8C 02 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 02 00 00


            //3.2.2	试剂臂在试剂盘一位置转头
            put("REAGENT_REAGENT_FIRST_HORIZONTAL", "E5 90 8C 02 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 02 01 00

            //3.2.3	试剂臂在反应盘位置转头
            put("REAGENT_REACT_HORIZONTAL", "E5 90 8C 02 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 02 02 00

            //3.2.4	试剂臂在试剂盘二位置转头
            put("REAGENT_REAGENT_SECOND_HORIZONTAL", "E5 90 8C 02 03 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 02 03 00
            //注：此命令为200机型的试剂臂在样品位水平调校

            //3.2.5	试剂臂在试剂盘三位置转头
            put("REAGENT_REAGENT_THIRD_HORIZONTAL", "E5 90 8C 02 04 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 02 04 00


            /**
             * 00
             * 样品臂垂直调校（8C 03）
             */
            //3.3.1	加样臂在清洗口位置升降
            put("SAMPLE_CLEAN_VERTICAL", "E5 90 8C 03 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 03 00 00

            //3.//3.2	加样臂在样品盘一位置升降
            put("SAMPLE_SAMPLE_FIRST_VERTICAL", "E5 90 8C 03 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 03 01 00

            //3.//3.3	加样臂在反应盘位置升降
            put("SAMPLE_REACT_VERTICAL", "E5 90 8C 03 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 03 02 00

            //3.//3.4	加样臂在样品盘二位置升降
            put("SAMPLE_SAMPLE_SECOND_VERTICAL", "E5 90 8C 03 03 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 03 03 00

            //3.//3.5	加样臂在样品盘三位置升降
            put("SAMPLE_SAMPLE_THIRD_VERTICAL", "E5 90 8C 03 04 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 03 04 00


            /**
             3.4	样品臂水平调校(8C 04)
             *
             */
            //3.4.1	加样臂在清洗口位置转头
            put("SAMPLE_CLEAN_HORIZONTAL", "E5 90 8C 04 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 04 00 00

            //3.4.2	加样臂在样品盘一位置转头
            put("SAMPLE_SAMPLE_FIRST_HORIZONTAL", "E5 90 8C 04 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 04 01 00

            //3.4.3	加样臂在反应盘位置转头
            put("SAMPLE_REACT_HORIZONTAL", "E5 90 8C 04 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 04 02 00

            //3.4.4	加样臂在样品盘二位置转头
            put("SAMPLE_SAMPLE_SECOND_HORIZONTAL", "E5 90 8C 04 03 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 04 03 00
            //注：此命令为200机型的试剂臂在样品位水平调校

            //3.4.5	加样臂在样品盘三位置转头
            put("SAMPLE_SAMPLE_THIRD_HORIZONTAL", "E5 90 8C 04 04 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 04 04 00


            /**
             * 3.5	试剂2臂垂直调校（8C 05）
             */
            //3.5.1	试剂2臂在清洗口位置升降
            put("REAGENT_2_CLEAN_VERTICAL", "E5 90 8C 05 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 05 00 00

            //3.5.2	试剂2臂在试剂盘一位置升降
            put("REAGENT_2_REAGENT_FIRST_VERTICAL", "E5 90 8C 05 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 05 01 00

            //3.5.3	试剂2臂在反应盘位置升降
            put("REAGENT_2_REACT_VERTICAL", "E5 90 8C 05 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 05 02 00

            //3.5.4	试剂2臂在试剂盘二位置升降
            put("REAGENT_2_REAGENT_SECOND_VERTICAL", "E5 90 8C 05 03 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 05 03 00

            //3.5.5	试剂2臂在试剂盘三位置升降
            put("REAGENT_2_REAGENT_THIRD_VERTICAL", "E5 90 8C 05 04 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 05 04 00


            /**
             3.6	试剂2臂水平调校（8C 06）
             *
             */
            //3.6.1	试剂2臂在清洗口位置转头
            put("REAGENT_2_CLEAN_HORIZONTAL", "E5 90 8C 06 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 06 00 00

            //3.6.2	试剂2臂在试剂盘一位置转头
            put("REAGENT_2_REAGENT_FIRST_HORIZONTAL", "E5 90 8C 06 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 06 01 00

            //3.6.3	试剂2臂在反应盘位置转头
            put("REAGENT_2_REACT_HORIZONTAL", "E5 90 8C 06 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 06 02 00

            //3.6.4	试剂2臂在试剂盘二位置转头
            put("REAGENT_2_REAGENT_SECOND_HORIZONTAL", "E5 90 8C 06 03 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 06 03 00

            //3.6.5	试剂2臂在试剂盘三位置转头
            put("REAGENT_2_REAGENT_THIRD_HORIZONTAL", "E5 90 8C 06 04 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 06 04 00

            /**
             * 3.7	样品搅拌臂垂直调校（8C 07）
             */
            //3.7.1	搅拌臂在清洗口位置升降
            put("SAMPLE_STIR_CLEAN_VERTICAL", "E5 90 8C 07 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 07 00 00

            //3.7.2	搅拌臂在反应盘位置升降
            put("SAMPLE_STIR_REACT_VERTICAL", "E5 90 8C 07 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 07 01 00

            /**
             * 3.8	样品搅拌臂水平调校（8C 08）
             */
            //3.8.1	搅拌臂在反应盘位置转头
            put("SAMPLE_STIR_REACT_HORIZONTAL", "E5 90 8C 08 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 08 00 00

            //3.8.2	搅拌臂在清洗口位置转头
            put("SAMPLE_STIR_CLEAN_HORIZONTAL", "E5 90 8C 08 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 08 01 00


            /**
             * 3.9	试剂搅拌臂垂直调校（8C 09）
             */
            //3.9.1	试剂搅拌臂在清洗口位置升降
            put("REAGENT_STIR_CLEAN_VERTICAL", "E5 90 8C 09 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 09 00 00

            //3.9.2	试剂搅拌臂在反应盘位置升降
            put("REAGENT_STIR_REACT_VERTICAL", "E5 90 8C 09 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 09 01 00

            /**
             * 3.10	试剂搅拌臂水平调校（8C 0A）
             */
            //3.10.1	试剂搅拌臂在反应盘位置转头
            put("REAGENT_STIR_REACT_HORIZONTAL", "E5 90 8C 0A 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0A 00 00

            //3.10.2	试剂搅拌臂在清洗口位置转头
            put("REAGENT_STIR_CLEAN_HORIZONTAL", "E5 90 8C 0A 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0A 01 00


            /**
             * 3.11	清洗臂垂直调校（8C 0B）
             */
            //3.11.1	清洗臂在反应盘位置0升降
            put("CLEAN_REACT_ZERO_VERTICAL", "E5 90 8C 0B 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0B 00 00

            //3.11.2	清洗臂在反应盘位置1升降
            put("CLEAN_REACT_FIRST_VERTICAL", "E5 90 8C 0B 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0B 01 00


            /**
             * 3.12	试剂1盘调校（8C 0C）
             */
            //3.12.1	试剂1盘在位置1旋转
            put("REAGENT_PLATE_FIRST_HORIZONTAL", "E5 90 8C 0C 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0C 00 00

            //3.12.2	试剂1盘在位置2旋转
            put("REAGENT_PLATE_SECOND_HORIZONTAL", "E5 90 8C 0C 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0C 01 00

            //3.12.3	试剂1盘在位置3旋转
            put("REAGENT_PLATE_THIRD_HORIZONTAL", "E5 90 8C 0C 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0C 02 00


            /**
             * 3.13	样品盘调校（8C 0D）
             */
            //3.13.1	样品盘在位置1旋转
            put("SAMPLE_PLATE_FIRST_HORIZONTAL", "E5 90 8C 0D 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0D 00 00

            //3.13.2	样品盘在位置2旋转
            put("SAMPLE_PLATE_SECOND_HORIZONTAL", "E5 90 8C 0D 01 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0D 01 00

            //3.13.3	样品盘在位置3旋转
            put("SAMPLE_PLATE_THIRD_HORIZONTAL", "E5 90 8C 0D 02 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8C 0D 02 00


            /**
             * 3.14	调校步伐（8D）
             */
            //3.14.1	加一步
            put("ADD_STEP_ONE", "E5 90 8D 00 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8D 00 00 00

            //3.14.2	减一步
            put("REDUCE_STEP_ONE", "E5 90 8D 01 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8D  01 00 00

            //3.14.3	加十步
            put("ADD_STEP_TEN", "E5 90 8D 04 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8D  04 00 00

            //3.14.4	减十步
            put("REDUCE_STEP_TEN", "E5 90 8D 05 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8D  05 00 00

            //3.14.5	不保存
            put("NOT_SAVE", "E5 90 8D 02 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8D  02 00 00

            //3.14.6	保存
            put("SAVE", "E5 90 8D 03 00 00 00 00 00 00 00 00 00 00 00 00");
            //2）动作完成返回：EB  91  8D  03 00 00
        }
    };
}
